module image_rom (
    input  wire [3:0] x,   // 0..15
    input  wire [3:0] y,   // 0..15
    output wire        pixel,  // 1 = закрашен, 0 = фон

    input  wire [3:0] x2,   // 0..15
    input  wire [3:0] y2,   // 0..15
    output wire        pixel2  // 1 = закрашен, 0 = фон
);

    reg [15:0] image [0:15]; // 16 строк по 16 бит (каждый бит = пиксель)
    reg [15:0] image2 [0:15]; // 16 строк по 16 бит (каждый бит = пиксель)

    initial begin
        image[0]  = 16'b1100000000000000;
        image[1]  = 16'b0111000000000000;
        image[2]  = 16'b0011100000000000;
        image[3]  = 16'b0011110000000000;
        image[4]  = 16'b0001111100000000;
        image[5]  = 16'b0000111110000000;
        image[6]  = 16'b0111111111110000;
        image[7]  = 16'b0001111111111111;
        image[8]  = 16'b0001111111111111;
        image[9]  = 16'b0111111111110000;
        image[10] = 16'b0000111110000000;
        image[11] = 16'b0001111100000000;
        image[12] = 16'b0011110000000000;
        image[13] = 16'b0011100000000000;
        image[14] = 16'b0111000000000000;
        image[15] = 16'b1100000000000000;

        image2[0]  = 16'b0000011111111000;
        image2[1]  = 16'b0000000001110000;
        image2[2]  = 16'b0000000011111000;
        image2[3]  = 16'b0000001111000000;
        image2[4]  = 16'b0000011100000000;
        image2[5]  = 16'b0011111110000000;
        image2[6]  = 16'b0111111111110000;
        image2[7]  = 16'b1111111111111111;

        image2[8]  = 16'b1111111111111111;
        image2[9]  = 16'b0111111111110000;
        image2[10] = 16'b0011111110000000;
        image2[11] = 16'b0000011100000000;
        image2[12] = 16'b0000001111000000;
        image2[13] = 16'b0000000011111000;
        image2[14] = 16'b0000000001110000;
        image2[15] = 16'b0000011111111000;

    end

    assign pixel = image[y][15 - x]; // индексация: старший бит = левый пиксель
    assign pixel2 = image2[y2][15 - x2]; // индексация: старший бит = левый пиксель

endmodule